test/src/test/testtool/Validators/Items/item-err-resp-out-soap1.1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><OutputValidationFailure xmlns="urn:items">
	<Result xmlns="http://nn.nl/XSD/Generic/MessageHeader/1">
		<Status>ERROR</Status>
		<ErrorList>
			<Error>
				<Code>ERR6993</Code>
				<Reason>Invalid Response</Reason>
				<Service>
					<Name/>
					<Context/>
					<Action>
						<Paradigm>Response</Paradigm>
						<Name>Test/Validator</Name>
						<Version>1</Version>
					</Action>
				</Service>
				<DetailList>
					<Detail>
						<Code>ERROR</Code>
						<Text>/Envelope/Body/Item_Response/Status: at (2,20): cvc-enumeration-valid: Value 'c' is not facet-valid with respect to enumeration '[a, b]'. It must be a value from the enumeration.</Text>
					</Detail>
					<Detail>
						<Code>ERROR</Code>
						<Text>/Envelope/Body/Item_Response/Status: at (2,20): cvc-type.3.1.3: The value 'c' of element 'Status' is not valid.</Text>
					</Detail>
				</DetailList>
			</Error>
		</ErrorList>
	</Result>
</OutputValidationFailure></soapenv:Body></soapenv:Envelope>